<?php

namespace Database\Seeders;

use App\Models\Language;
use App\Models\User;
// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     */
    public function run(): void
    {

        $languages = [
            'Африкаанс', 'Албански', 'Амхарски', 'Арабски', 'Арменски', 'Азербайджански', 
            'Баски', 'Беларуски', 'Бенгалски', 'Босненски', 'Български', 'Бирмански', 
            'Каталонски', 'Себуански', 'Китайски', 'Корсикански', 'Хърватски', 'Чешки', 
            'Датски', 'Нидерландски', 'Английски', 'Есперанто', 'Естонски', 'Финландски', 
            'Френски', 'Галицийски', 'Грузински', 'Немски', 'Гръцки', 'Гуджарати', 
            'Креолски (Хаити)', 'Хауса', 'Иврит', 'Хинди', 'Унгарски', 'Исландски', 
            'Игбо', 'Индонезийски', 'Ирландски', 'Италиански', 'Японски', 'Явански', 
            'Каннада', 'Казахски', 'Кхмерски', 'Корейски', 'Кюрдски', 'Киргизки', 'Лаоски', 
            'Латински', 'Латвийски', 'Литовски', 'Люксембургски', 'Македонски', 'Малгашки', 
            'Малайски', 'Малаялам', 'Малтийски', 'Маорски', 'Марати', 'Монголски', 
            'Непалски', 'Норвежки', 'Одиа', 'Пущу', 'Персийски', 'Полски', 
            'Португалски', 'Пенджабски', 'Кечуа', 'Румънски', 'Руски', 'Самоански', 
            'Шотландски галски', 'Сръбски', 'Шона', 'Синдхи', 'Синхалски', 'Словашки', 
            'Словенски', 'Сомалийски', 'Испански', 'Сундански', 'Суахили', 'Шведски', 
            'Тагалог', 'Таджикски', 'Тамилски', 'Татарски', 'Телугу', 'Тайски', 'Тигриня', 
            'Турски', 'Туркменски', 'Украински', 'Урду', 'Уйгурски', 'Узбекски', 
            'Виетнамски', 'Уелски', 'Кхоса', 'Идиш', 'Йоруба', 'Зулу'
        ];

        foreach ($languages as $language) {
            Language::firstOrCreate(['language_name' => $language]);
        }

    }
}
